package main

import "fmt"

func main() {
	fmt.Println(change(5, []int{1, 2, 5}))
}

// 输入：amount = 5, coins = [1, 2, 5]
//输出：4
//解释：有四种方式可以凑成总金额：
//5=5
//5=2+2+1
//5=2+1+1+1
//5=1+1+1+1+1

//   0 1 2 3 4 5
// 1 0 1 1 1 1 1
// 2 0 0 2 1 2 1
// 5 0 0 0 0 0 1
// dp=make([][]int,amount+1)
// dp[i][j] 的定义，表示 i元组成总金额j元的方式数
// dp[1][0]=0
// dp[1][1]=1
// dp[1][2]=1
// dp[1][3]=1
// dp[1][4]=1
// dp[1][5]=1
// dp[2][0]=0
// dp[2][1]=0
// dp[2][2]=1
// dp[2][3]=dp[1][3]+dp[2][3]=1+0=1
// dp[2][4]=dp[1][4]+dp[2][4]=1+1=2
// dp[2][5]=dp[1][5]+dp[2][5]=1+0=1
// dp[5][0]=0
// dp[5][1]=dp[1][1]+dp[2][1]+dp[5][1]=1
// dp[5][2]=dp[1][2]+dp[2][2]+dp[5][2]=1+1+0=2
// ...
// 是不是可以将二维压缩为一维呢？
// dp[i] 表示目标金额i，总共有多少种组合方式
// dp[0]=0
// dp[1]=dp[1][1]+dp[2][1]+dp[5][1]=1+0+0=1
// dp[2]=dp[1][2]+dp[2][2]+dp[5][1]=1+1+0=2
// dp[3]=dp[1][3]+dp[2][3]+dp[5][3]=1+0+0=1

// 这里发现一个问题，如果将金额压缩
// dp[3]=dp[1]+dp[2]+dp[5]
// 会发现当金额等于3的时候，会用到5的值，此时5还没有计算，所以需要倒排
// dp[5] 表示 目标金额 5 在 1元下的场景：
// dp[0]=0
// for _,c:=range coins {
//    for i:=amount;i>=0;i--{
//        if c==i{
//           dp[i]=dp[i]+1
//        }
//        dp[i]=dp[i-1]
//    }
// }
//   0 1 2 3 4 5
// 1 0 1 1 1 1 1
// 2 0 1 2 1 2 2
// 5 0 1 2 1 2
// 不对，答案不是在右下角，答案应该分布在dp表里面
// 1 0 1 1 1 1 1
// 2 0 0 1 0 1 0
// 5 0 0 0 0 0 1
// 不对，换个角度想，dp表应该记录的是当前金额能否刚好分完
// 1 f t t t t t
// 2 f f t f t f
// 5 f f f f f t

// 种子为1
//   0 1 2 3 4 5
// 1 1 1 1 1 1 1
// 2 1 1 2 2 3 3
// 5 1 1 2 2 3 4
func change(amount int, coins []int) int {
	if amount == 0 {
		return 1
	}
	n := len(coins)
	if n == 0 {
		return 0
	}
	dp := make([]int, amount+1)
	dp[0] = 1
	for _, c := range coins {
		for i := c; i < amount+1; i++ {
			dp[i] += dp[i-c]
		}
	}
	return dp[amount]
}
