package main

import "fmt"

func main() {
	fmt.Println(maxCoins([]int{3, 1, 5, 8}))
}

// 输入：nums = [3,1,5,8]
//输出：167
//解释：
//nums = [3,1,5,8] --> [3,5,8] --> [3,8] --> [8] --> []
//coins =  3*1*5    +   3*5*8   +  1*3*8  + 1*8*1 = 167

// 顺序有关的，所以是排列，不是组合
// 而且，元素不能重复使用
// 而且不同的排列会产生不同的结果
// 所以最终答案在dp表中心
// 一维表不够
// 二维表
// dp[i][j] 含义 从 i .. j
// 或者说，是从 nums 中取出i个数
// 顺序有关，金额在外，物品在内。物品=nums
// 手推
//nil	nil	1	3	1	5	8	1
//nil	nil	0	1	2	3	4	5
//1	0			3	30	159	167
//3	1				15	135	159
//1	2					40	48
//5	3						40
//8	4
//1	5
// dp[0][3]:
//k=1=>
//dp[0][1]+dp[1][3]+v[0]*v[1]*v[3]
//0+15+1*3*5=30
//k=2=>
//dp[0][2]+dp[2][3] + v[0]*v[2]*v[3]
//3 + 0 + 1*1*5=8
//dp[1][4]
//k=2=>
//dp[1][2]+dp[2][4]+v[1]*v[2]*v[4]
//0+40+3*1*8=64
//k=3=>
//dp[1][3]+d[3][4]+v[1]*v[3]*v[4]
//15+0+3*5*8=135
//dp[2][5]
//k=3=>
//dp[2][3]+dp[3][5]+v[2]*v[3]*v[5]
//0+40+1*5*1=45
//k=4=>
//dp[2][4]+dp[4][5]+v[2]*v[4]*v[5]
//40+0+1*8*1=48
//dp[0][4]
//k=1=>
//dp[0][1]+dp[1][4]+v[0]*v[1]*v[4]
//0+135+1*3*8=159
//k=2=>
//dp[0][2]+dp[2][4]+v[0]*v[2]*v[4]
//3+40+1*1*8=51
//k=3=>
//dp[0][3]+dp[3][4]+v[0]*v[3]*v[4]
//30+0+1*5*8=70
//dp[1][5]
//k=2=>
//dp[1][2]+dp[2][5]+v[1]*v[2]*v[5]
//0+48+3*1*1=51
//k=3=>
//dp[1][3]+dp[3][5]+v[1]*v[3]*v[5]
//15+40+3*5*1=70
//k=4=>
//dp[1][4]+dp[4][5]+v[1]*v[4]*v[5]
//135+0+3*8*1=159
//dp[0][5]
//k=1=>
//dp[0][1]+dp[1][5]+v[0]*v[1]*v[5]
//0+159+1*3*1 = 162
//k=2=>
//dp[0][2]+dp[2][5]+v[0]*v[2]*v[5]
//3+48+1*1*1=52
//k=3=>
//dp[0][3]+dp[3][5]+v[0]*v[3]*v[5]
//30+40+1*5*1=75
//k=4=>
//dp[0][4]+dp[4][5]+v[0]*v[4]*v[5]
//159+0+1*8*1=167
func maxCoins(nums []int) int {
	n := len(nums)
	if n == 0 {
		return 0
	}
	nNums := append([]int{1}, nums...)
	nNums = append(nNums, 1)
	// 左右两端各增加虚拟气球
	n = len(nNums)
	dp := make([][]int, n)
	for i := range dp {
		dp[i] = make([]int, n)
	}
	// len=3,4,5 n=5
	for l := 3; l <= n; l++ {
		// l=3
		// k = 1,2
		// 左边端点
		// 0,1 ; 0,2
		// 右边端点
		// l-1
		for i := 0; i+l-1 < n; i++ {
			// 右边端点
			j := i + l - 1
			// k 1,2
			// k 的范围出来了
			// 如何取值？
			// max(dp[i][k]+dp[k][j]+v[i]*v[k]*v[j]
			for k := i + 1; k < j; k++ {
				dp[i][j] = max(dp[i][j], dp[i][k]+dp[k][j]+nNums[i]*nNums[k]*nNums[j])
			}
		}
	}
	return dp[0][n-1]
}
